Revit 2024 API
MultiReferenceAnnotation Class
 Multi-reference annotations are annotations pointing to more than one reference, consisting of a dimension and associated tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class MultiReferenceAnnotation : Element
Visual Basic
Public Class MultiReferenceAnnotation _
	Inherits Element
Visual C++
public ref class MultiReferenceAnnotation : public Element
Remarks
 Multi-reference annotations can be used to label and dimension Rebar elements, and are labeled in the user interface as "Multi-rebar annotations". MultiReferenceAnnotation is the annotation object instance. This class includes a reference to the associated dimension and tag element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MultiReferenceAnnotation
See Also
MultiReferenceAnnotation Members
Autodesk.Revit.DB Namespace